import { DateEvent } from "features/SliderEvents";

export const data: DateEvent[] = [
  {
    dateStart: "1961",
    dateEnd: "1962",
    facts: [
      {
        id: 1,
        title: "1961",
        description:
          "Юрий Гагарин стал первым человеком, совершившим полёт в космос на корабле 'Восток-1'.",
      },
      {
        id: 2,
        title: "1961",
        description:
          "Создание Управления космической авиации Министерства обороны СССР.",
      },
      {
        id: 3,
        title: "1961",
        description:
          "Запуск первой межконтинентальной баллистической ракеты Р-16.",
      },
      {
        id: 4,
        title: "1961",
        description: "Операция «Свинолесье» - провокация США против Кубы.",
      },
      {
        id: 5,
        title: "1961",
        description: "Открытие Берлинской стены.",
      },
    ],
  },
  {
    dateStart: "1969",
    dateEnd: "1972",
    facts: [
      {
        id: 6,
        title: "1969",
        description:
          "Экипаж 'Аполлона-11' совершил первую успешную высадку на Луну. Нил Армстронг стал первым человеком, ступившим на поверхность Луны.",
      },
      {
        id: 7,
        title: "1969",
        description:
          "Рождение Интернета, передача первого сообщения между компьютерами.",
      },
      {
        id: 8,
        title: "1969",
        description:
          "Стэнфордский эксперимент Филипа Зимбардо по исследованию поведения человека в тюремных условиях.",
      },
      {
        id: 9,
        title: "1969",
        description:
          "Фестиваль Вудсток - крупнейший музыкальный фестиваль того времени.",
      },
      {
        id: 10,
        title: "1969",
        description:
          "Убийство Шэрон Тейт и её друзей членами секты Чарльза Мэнсона.",
      },
    ],
  },
  {
    dateStart: "1989",
    dateEnd: "1991",
    facts: [
      {
        id: 11,
        title: "1989",
        description:
          "Тим Бернерс-Ли представил концепцию World Wide Web, изменившую способ взаимодействия с информацией.",
      },
      {
        id: 12,
        title: "1989",
        description:
          "Падение Берлинской стены, знаменующее окончание Холодной войны и объединение Германии.",
      },
      {
        id: 13,
        title: "1989",
        description: "Массовые протесты на площади Тяньаньмэнь в Китае.",
      },
      {
        id: 14,
        title: "1989",
        description: "Крушение перевала Дятлова на Северном Урале.",
      },
      {
        id: 15,
        title: "1989",
        description: "Разлив нефти с танкера Exxon Valdez у побережья Аляски.",
      },
    ],
  },
  {
    dateStart: "2007",
    dateEnd: "2012",
    facts: [
      {
        id: 16,
        title: "2007",
        description:
          "Apple выпустила первый iPhone, что стало революцией в индустрии смартфонов.",
      },
      {
        id: 17,
        title: "2007",
        description:
          "Начало финансового кризиса, приведшего к Великой рецессии.",
      },
      {
        id: 18,
        title: "2007",
        description:
          "Запуск первого спутника частной космической компании SpaceX.",
      },
      {
        id: 19,
        title: "2007",
        description:
          "Заявление о глобальном потеплении и угрозе изменения климата, получившее Нобелевскую премию мира.",
      },
      {
        id: 20,
        title: "2007",
        description: "Катастрофа моста I-35W в Миннеаполисе.",
      },
    ],
  },
  {
    dateStart: "2019",
    dateEnd: "2022",
    facts: [
      {
        id: 21,
        title: "2019",
        description:
          "Учёные представили первое изображение чёрной дыры, снятое при помощи телескопа Event Horizon Telescope.",
      },
      {
        id: 22,
        title: "2019",
        description:
          "Массовые протесты в Гонконге против предложенных властями изменений в законодательстве.",
      },
      {
        id: 23,
        title: "2019",
        description:
          "Лесные пожары в Австралии, повлекшие гибель миллионов животных.",
      },
      {
        id: 24,
        title: "2019",
        description: "Начало пандемии COVID-19.",
      },
      {
        id: 25,
        title: "2019",
        description: "Запуск первой коммерческой миссии к МКС.",
      },
    ],
  },
  {
    dateStart: "2023",
    dateEnd: "2023",
    facts: [
      {
        id: 26,
        title: "2023",
        description: "Восстановление экономики после пандемии COVID-19.",
      },
      {
        id: 27,
        title: "2023",
        description:
          "Дальнейшее развитие технологий искусственного интеллекта.",
      },
      {
        id: 28,
        title: "2023",
        description:
          "Продолжение борьбы с изменением климата и переход к возобновляемым источникам энергии.",
      },
      {
        id: 29,
        title: "2023",
        description: "Неопределенность геополитической ситуации.",
      },
      {
        id: 30,
        title: "2023",
        description: "Новые достижения в космической отрасли.",
      },
    ],
  },
];
