import { DateEvent } from "./type";


export const data: DateEvent[] = [
  {
    dateStart: "1945",
    title: "Наука",
    dateEnd: "1960",
    facts: [
      {
        id: 1,
        title: "1945",
        description:
          "Сброс атомных бомб на Хиросиму и Нагасаки, завершивших Вторую мировую войну.",
      },
      {
        id: 2,
        title: "1947",
        description:
          "Создание первого транзистора, положившего начало современной электронике.",
      },
      {
        id: 3,
        title: "1953",
        description:
          "Расшифровка структуры ДНК Уотсоном и Криком, открывшая новую эру в генетике.",
      },
      {
        id: 4,
        title: "1957",
        description:
          "Запуск первого искусственного спутника Земли, 'Спутник-1', начавший космическую гонку.",
      },
      {
        id: 5,
        title: "1960",
        description:
          "Изобретение лазера, которое перевернуло многие отрасли науки.",
      },
    ],
  },
  {
    dateStart: "1961",
    dateEnd: "1972",
    facts: [
      {
        id: 6,
        title: "1961",
        description:
          "Юрий Гагарин стал первым человеком в космосе, совершив полёт на корабле 'Восток-1'.",
      },
      {
        id: 7,
        title: "1969",
        description:
          "Первая высадка человека на Луну в рамках миссии 'Аполлон-11'.",
      },
      {
        id: 8,
        title: "1971",
        description:
          "Запуск первой космической станции 'Салют-1', открывшей возможности долговременного пребывания в космосе.",
      },
      {
        id: 9,
        title: "1972",
        description:
          "Последний пилотируемый полёт к Луне в рамках программы 'Аполлон-17'.",
      },
    ],
  },
  {
    dateStart: "1980",
    title: "Технологии",
    dateEnd: "1999",
    facts: [
      {
        id: 10,
        title: "1981",
        description: "Выпуск первого персонального компьютера IBM.",
      },
      {
        id: 11,
        title: "1989",
        description:
          "Тим Бернерс-Ли представил концепцию World Wide Web, изменившую способ взаимодействия с информацией.",
      },
      {
        id: 12,
        title: "1991",
        description:
          "Официальный запуск Интернета для общественного использования.",
      },
      {
        id: 13,
        title: "1998",
        description:
          "Создание компании Google, изменившей способ поиска информации.",
      },
      {
        id: 14,
        title: "1999",
        description: "Расцвет электронной коммерции и запуск платформы Amazon.",
      },
    ],
  },
  {
    dateStart: "2000",
    title: "Биология",
    dateEnd: "2015",
    facts: [
      {
        id: 15,
        title: "2001",
        description:
          "Публикация первого чернового варианта генома человека в рамках проекта 'Геном человека'.",
      },
      {
        id: 16,
        title: "2003",
        description:
          "Официальное завершение расшифровки генома человека, открывшее новую эру в медицине.",
      },
      {
        id: 17,
        title: "2008",
        description:
          "Создание первого искусственного бактериального генома учёными под руководством Крэйга Вентера.",
      },
      {
        id: 18,
        title: "2012",
        description:
          "Разработка технологии редактирования генов CRISPR-Cas9, начавшая революцию в биоинженерии.",
      },
      {
        id: 19,
        title: "2015",
        description:
          "Разработка методов иммунной терапии рака с использованием Т-клеток.",
      },
    ],
  },
  {
    dateStart: "2016",
    title: "Климат",
    dateEnd: "2022",
    facts: [
      {
        id: 20,
        title: "2016",
        description:
          "Заключение Парижского соглашения по климату, нацеленное на сокращение выбросов углекислого газа.",
      },
      {
        id: 21,
        title: "2019",
        description:
          "Широкомасштабные лесные пожары в Австралии, уничтожившие миллионы гектаров лесов.",
      },
      {
        id: 22,
        title: "2020",
        description:
          "Мировая пандемия COVID-19 привлекла внимание к проблемам общественного здравоохранения и экологии.",
      },
      {
        id: 23,
        title: "2021",
        description:
          "Массовый переход стран на возобновляемые источники энергии.",
      },
      {
        id: 24,
        title: "2022",
        description:
          "Развитие технологий улавливания углекислого газа для борьбы с глобальным потеплением.",
      },
    ],
  },
  {
    dateStart: "2023",
    title: "Космос",
    dateEnd: "2023",
    facts: [
      {
        id: 25,
        title: "2023",
        description:
          "Учёные обнаружили первые свидетельства жизни на экзопланете.",
      },
      {
        id: 26,
        title: "2023",
        description:
          "Успешная миссия на Луну с участием роботов-исследователей.",
      },
      {
        id: 27,
        title: "2023",
        description:
          "Достижения в области космического строительства для будущих миссий на Марс.",
      },
      {
        id: 28,
        title: "2023",
        description:
          "Развитие телескопов нового поколения для изучения далёких галактик.",
      },
      {
        id: 29,
        title: "2023",
        description: "Первые шаги к освоению астероидов для добычи ресурсов.",
      },
    ],
  },
];
