export type Fact = {
  title: string;
  description: string;
};
export const data: Fact[] = [
  {
    title: "1961",
    description:
      "Юрий Гагарин стал первым человеком, совершившим полёт в космос на корабле 'Восток-1'.",
  },
  {
    title: "1969",
    description:
      "Экипаж 'Аполлона-11' совершил первую успешную высадку на Луну. Нил Армстронг стал первым человеком, ступившим на поверхность Луны.",
  },
  {
    title: "1989",
    description:
      "Тим Бернерс-Ли представил концепцию World Wide Web, изменившую способ взаимодействия с информацией.",
  },
  {
    title: "1989",
    description:
      "Падение Берлинской стены ознаменовало окончание Холодной войны и объединение Германии.",
  },
  {
    title: "2007",
    description:
      "Apple выпустила первый iPhone, что стало революцией в индустрии смартфонов.",
  },
  {
    title: "2019",
    description:
      "Учёные представили первое изображение чёрной дыры, снятое при помощи телескопа Event Horizon Telescope.",
  },
];
