import { DateEvent } from "features/SlideEvents";

export const data: DateEvent[] = [
  {
    dateStart: "1961-01-01",
    dateEnd: "1961-12-31",
    facts: [
      {
        title: "1961",
        description:
          "Юрий Гагарин стал первым человеком, совершившим полёт в космос на корабле 'Восток-1'.",
      },
      {
        title: "1961",
        description:
          "Создание Управления космической авиации Министерства обороны СССР.",
      },
      {
        title: "1961",
        description:
          "Запуск первой межконтинентальной баллистической ракеты Р-16.",
      },
      {
        title: "1961",
        description: "Операция «Свинолесье» - провокация США против Кубы.",
      },
      {
        title: "1961",
        description: "Открытие Берлинской стены.",
      },
    ],
  },
  {
    dateStart: "1969-01-01",
    dateEnd: "1969-12-31",
    facts: [
      {
        title: "1969",
        description:
          "Экипаж 'Аполлона-11' совершил первую успешную высадку на Луну. Нил Армстронг стал первым человеком, ступившим на поверхность Луны.",
      },
      {
        title: "1969",
        description:
          "Рождение Интернета, передача первого сообщения между компьютерами.",
      },
      {
        title: "1969",
        description:
          "Стэнфордский эксперимент Филипа Зимбардо по исследованию поведения человека в тюремных условиях.",
      },
      {
        title: "1969",
        description:
          "Фестиваль Вудсток - крупнейший музыкальный фестиваль того времени.",
      },
      {
        title: "1969",
        description:
          "Убийство Шэрон Тейт и её друзей членами секты Чарльза Мэнсона.",
      },
    ],
  },
  {
    dateStart: "1989-01-01",
    dateEnd: "1989-12-31",
    facts: [
      {
        title: "1989",
        description:
          "Тим Бернерс-Ли представил концепцию World Wide Web, изменившую способ взаимодействия с информацией.",
      },
      {
        title: "1989",
        description:
          "Падение Берлинской стены, знаменующее окончание Холодной войны и объединение Германии.",
      },
      {
        title: "1989",
        description: "Массовые протесты на площади Тяньаньмэнь в Китае.",
      },
      {
        title: "1989",
        description: "Крушение перевала Дятлова на Северном Урале.",
      },
      {
        title: "1989",
        description: "Разлив нефти с танкера Exxon Valdez у побережья Аляски.",
      },
    ],
  },
  {
    dateStart: "2007-01-01",
    dateEnd: "2007-12-31",
    facts: [
      {
        title: "2007",
        description:
          "Apple выпустила первый iPhone, что стало революцией в индустрии смартфонов.",
      },
      {
        title: "2007",
        description:
          "Начало финансового кризиса, приведшего к Великой рецессии.",
      },
      {
        title: "2007",
        description:
          "Запуск первого спутника частной космической компании SpaceX.",
      },
      {
        title: "2007",
        description:
          "Заявление о глобальном потеплении и угрозе изменения климата, получившее Нобелевскую премию мира.",
      },
      {
        title: "2007",
        description: "Катастрофа моста I-35W в Миннеаполисе.",
      },
    ],
  },
  {
    dateStart: "2019-01-01",
    dateEnd: "2019-12-31",
    facts: [
      {
        title: "2019",
        description:
          "Учёные представили первое изображение чёрной дыры, снятое при помощи телескопа Event Horizon Telescope.",
      },
      {
        title: "2019",
        description:
          "Массовые протесты в Гонконге против предложенных властями изменений в законодательстве.",
      },
      {
        title: "2019",
        description:
          "Лесные пожары в Австралии, повлекшие гибель миллионов животных.",
      },
      {
        title: "2019",
        description: "Начало пандемии COVID-19.",
      },
      {
        title: "2019",
        description: "Запуск первой коммерческой миссии к МКС.",
      },
    ],
  },
  {
    dateStart: "2023-01-01",
    dateEnd: "2023-12-31",
    facts: [
      {
        title: "2023",
        description: "Восстановление экономики после пандемии COVID-19.",
      },
      {
        title: "2023",
        description:
          "Дальнейшее развитие технологий искусственного интеллекта.",
      },
      {
        title: "2023",
        description:
          "Продолжение борьбы с изменением климата и переход к возобновляемым источникам энергии.",
      },
      {
        title: "2023",
        description: "Неопределенность геополитической ситуации.",
      },
      {
        title: "2023",
        description: "Новые достижения в космической отрасли.",
      },
    ],
  },
];
